In [3]:
#count no of vowels
text = input("enter a string")
vowels = "aeiouAEIOU"
count = 0

for i in text:
    if i in vowels:
        count+=1
print("number of vowels:", count)

number of vowels: 2

In [4]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\avinash\downloads\my projects\machine learning projects\.venv\lib\site-packages (2.2.1)

In [7]:
#mean and std devation of an array using numpy
import numpy as np
array = [1,2,3,4,5,6]
mean = np.mean(array)
std_dev = np.std(array)
print("my array:", array)
print("mean:", mean)
print("standard deveation:", std_dev)

my array: [1, 2, 3, 4, 5, 6]
mean: 3.5
standard deveation: 1.707825127659933

In [8]:
#"basic statictics of numerical columns using pandas
import pandas as pd
df = pd.read_csv("./data/sample_numerical_data.csv")
df

      Name  Sales  Age  Experience (Years)
0    Alice    200   25                   2
1      Bob    300   30                   5
2  Charlie    250   28                   3
3    David    400   35                   7
4     Emma    350   27                   4

In [9]:
print("basic statictics of numerical columns:")
print(df.describe())

basic statictics of numerical columns:
            Sales        Age  Experience (Years)
count    5.000000   5.000000            5.000000
mean   300.000000  29.000000            4.200000
std     79.056942   3.807887            1.923538
min    200.000000  25.000000            2.000000
25%    250.000000  27.000000            3.000000
50%    300.000000  28.000000            4.000000
75%    350.000000  30.000000            5.000000
max    400.000000  35.000000            7.000000

In [10]:
#binary search
def binary_search(arr, target):
    left, right = 0, len(arr) - 1
    while left <= right:
        mid = (left + right) // 2
        if arr[mid] == target:
            return mid
        elif arr[mid] < target:
            left = mid + 1
        else:
            right = mid - 1
    return -1


arr = [1, 3, 5, 7, 9]
target = 5
print("Index of target:", binary_search(arr, target))

Index of target: 2

In [13]:
#Use NumPy to perform matrix multiplication and calculate eigenvalues
import numpy as np
A = np.array([[1,2], [3,4]])
B = np.array([[5,6], [7,8]])
mat_multiply = np.dot(A,B)
print("The multiplication of two matrix is:", mat_multiply)

eigenvalues, _ = np.linalg.eig(A)
print("The eigen values of A is:", eigenvalues)

The multiplication of two matrix is: [[19 22]
 [43 50]]
The eigen values of A is: [-0.37228132  5.37228132]

In [14]:
#. Clean a Pandas DataFrame by handling missing values and removing duplicates
import pandas as pd
data = {
    "A": [1,2, None, 4],
    "B": [2, 2, 3, 3],
    "c": [None, 'X', 'Y', 'Y']
}
df = pd.DataFrame(data)
df

     A  B     c
0  1.0  2  None
1  2.0  2     X
2  NaN  3     Y
3  4.0  3     Y

In [20]:
df['A'] = df['A'].fillna(df['A'].mean())
df = df.dropna()
df = df.drop_duplicates()

In [25]:
df

          A  B  c
1  2.000000  2  X
2  2.333333  3  Y
3  4.000000  3  Y

In [26]:
#Create a custom Python decorator to measure function execution time
import time

def execution_time(func):
    def wrapper(*args, **kwargs):
        start_time = time.time()
        result = func(*args, **kwargs)
        end_time = time.time()
        print(f"Execution time: {end_time - start_time:.4f} seconds")
        return result
    return wrapper

@execution_time
def example_function(n):
    return sum(range(n))


example_function(1000000)

Execution time: 0.0338 seconds

499999500000

In [28]:
#Use NumPy to solve a system of linear equations
import numpy as np


A = np.array([[3, 1], [1, 2]])


B = np.array([9, 8])


solution = np.linalg.solve(A, B)

print("Solution:", solution)

Solution: [2. 3.]

In [34]:
# Perform complex data transformation and groupby analysis in Pandas
import pandas as pd


data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'C', 'C'],
    'Sales': [100, 200, 150, 300, 50, 400, 350],
    'Profit': [20, 50, 30, 80, 10, 100, 90],
    'Region': ['East', 'West', 'East', 'West', 'East', 'North', 'North']
}

df = pd.DataFrame(data)
print("Original DataFrame:")
df

Original DataFrame:

  Category  Sales  Profit Region
0        A    100      20   East
1        B    200      50   West
2        A    150      30   East
3        B    300      80   West
4        A     50      10   East
5        C    400     100  North
6        C    350      90  North

In [35]:
df['Taxed Sales'] = df['Sales'] * 1.10
df

  Category  Sales  Profit Region  Taxed Sales
0        A    100      20   East        110.0
1        B    200      50   West        220.0
2        A    150      30   East        165.0
3        B    300      80   West        330.0
4        A     50      10   East         55.0
5        C    400     100  North        440.0
6        C    350      90  North        385.0

In [36]:
df['Normalized Profit'] = df['Profit'] / df['Profit'].max()

In [38]:
print("dataframe after transformation")
df

dataframe after transformation

  Category  Sales  Profit Region  Taxed Sales  Normalized Profit
0        A    100      20   East        110.0                0.2
1        B    200      50   West        220.0                0.5
2        A    150      30   East        165.0                0.3
3        B    300      80   West        330.0                0.8
4        A     50      10   East         55.0                0.1
5        C    400     100  North        440.0                1.0
6        C    350      90  North        385.0                0.9

In [39]:
grouped = df.groupby('Category').agg({
    'Sales': 'sum',              # Total sales
    'Profit': 'sum',             # Total profit
    'Taxed Sales': 'mean'        # Average taxed sales
})

In [42]:
print("grouped data")
grouped

grouped data

          Sales  Profit  Taxed Sales
Category
A           300      60        110.0
B           500     130        275.0
C           750     190        412.5